#sun= input("Введите 1 если погода солнечная, и 2 если пасмурная: ")
#if sun == "1":
#    d="Нужно загорать"
#else:
#    d="Загорать не выйдет"
#print(d)
v= int(input("Введите сколько вам лет: "))
if v<=18:
    print("Привет, юный кодер :)")
elif v<=30:
    print("Привет, папша. Как там детишки?")
elif v<=40:
    print("Привет старпер, печень живая еще? :)")
elif v<=50:
    print('Привет дедушка, внуки уже есть?')
elif v<=65:
    print("Пенсию регулярно получаешь?")
elif v<=100:
    print("Столько не живут:)")